<template>
  <div class="q-px-lg">
    <q-timeline color="secondary">
      <q-timeline-entry heading>
        <div class="text-h4 text-weight-medium text-blue-10">
          Процесс Создания
        </div>
      </q-timeline-entry>

      <q-timeline-entry title="Создано" subtitle="7 Июля 2024">
        <div>
          Проблема была зарегистрирована сотрудником службы информационной
          безопасности, Сағат Ф. И., с целью улучшения условий труда.
          Предложение касалось создания зон отдыха и релаксации в офисных
          помещениях для предотвращения переутомления сотрудников.
        </div>
      </q-timeline-entry>

      <q-timeline-entry
        title="Одобрено на голосования"
        subtitle="9 Июля 2024"
        color="orange"
        icon="check"
      >
        <div>
          После рассмотрения предложения руководством компании, инициатива была
          одобрена для публичного обсуждения и голосования среди сотрудников.
          Было принято решение о включении данной идеи в программу улучшения
          условий труда.
        </div>
      </q-timeline-entry>

      <q-timeline-entry heading>
        <div class="text-h4 text-weight-medium text-blue-10">
          Процесс Голосования
        </div>
      </q-timeline-entry>

      <q-timeline-entry
        title="Начала голосования"
        subtitle="9 Июля 2024"
        icon="start"
      >
        <div>
          Голосование среди сотрудников было открыто 9 июля 2024 года, чтобы
          оценить поддержку инициативы. Все сотрудники компании получили
          возможность внести свои голоса и выразить мнение по предложению.
        </div>
      </q-timeline-entry>

      <q-timeline-entry title="Завершения голосования" subtitle="29 Июля 2024">
        <div>
          Голосование завершилось с положительным результатом — большинство
          сотрудников поддержали предложение по созданию зон отдыха. Это
          позволило перейти к этапу реализации.
        </div>
      </q-timeline-entry>

      <q-timeline-entry
        title="Передано на реализацию"
        subtitle="1 Августа 2024"
        color="orange"
        icon="check"
      >
        <div>
          После успешного голосования проект был передан в отдел
          материально-технического обеспечения для разработки плана реализации и
          создания зон отдыха в офисах.
        </div>
      </q-timeline-entry>
      <q-timeline-entry
        title="Завершено"
        subtitle="8 Августа 2024"
        color="green"
        icon="done_all"
      >
        <div>
          Работы по созданию зон отдыха были завершены 8 августа 2024 года.
          Сотрудники теперь могут пользоваться оборудованными зонами для
          релаксации, что положительно скажется на их мотивации и
          производительности.
        </div>
      </q-timeline-entry>
    </q-timeline>
  </div>
</template>
